content/archive/not-bsky-not-threads-just-the-fedi.md
+++
title = "Not Threads, Not Twitter. Come Join Us!"
authors = ["Soc Virnyl Estela"]
description = "The Fediverse is growing. Join now!"
date = 2023-07-18
tags = ["social", "fediverse"]
draft = false
[taxonomies]
  tags = ["social", "fediverse"]
+++

The Fediverse is growing. Joining the Fediverse is good. But **I do not recommend you joining _Threads_,
or go back to _Twitter_**.


## Not Threads, Not Twitter {#not-threads-not-twitter}

Twitter is self-explanatory. Threads, however, are new platforms that support [ActivityPub](https://www.w3.org/TR/activitypub/). This means it can
communicate with other platforms that also support this _protocol_ e.g. you can follow people from your instance
to someone who is on Threads.

But **Threads is owned by Meta**, who are notorious for their aggressive data collection and poor privacy protection
and policies. And they are also known for manipulating public information, and spreading propaganda to accommodate
personal interests from politics to mass misinformation.

_Why should you join a platform who is backed by a company
known for such practices_?

You may have your reasons. It maybe valid e.g. because your fam uses Facebook, specifically, Facebook Messenger to
communicate, but if you have the option to do so, do so now. These companies do not care much about your well-being
since they designed these platform for clout-chasing, dopamine addiction, and a new culture of attention-seekers
that are dumb to a point.

## Come Join the Fediverse! {#come-join-the-fediverse}

The fediverse is good.
